#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "1be2ceca41c24b1d31bc89b0ca9dac3e" -> "6173d85ed155f9444053dbf99cf06a52"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "16dfc042ec782f0a4d72e82cbce58cc4" -> "9f3baff03a1a6debacde4b95414d0ec4"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "b7ea9969ef58cd53a7835364208bc0c3" -> "a731c8e7ef9813ff1f625a53025876f5"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8b77a1f7ad6d7c4cb05c2e4e27836f40" -> "cb7ddbc1771a7e1326d07d01478ed964"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "d76f9645b23236689e01c6c9c572990f" -> "4ea52e4386511b37a0955e44ce6e69db"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "40fce44b33d2c097b6032055432403ec" -> "37a664ddab42fa84d2dc1826fddd928d"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "71191a0425eecc6bef1db49db322db55" -> "10372c0facc617e22125f544987feb7c"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "3bb2da7aaf36e5729c4650baf175ef3b" -> "97528b88947fcb968dcd5a9ff80e6476"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "65ac27e75ac4e7261107a069b038abb0" -> "f5f7a9d01127ba3866e34f78c1eb4ce4"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "918ce52f115e0fa20ce83d3836207c09" -> "dbc8b92b0c84e467702e497d86d0dc32"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "662c357a85af01a4379cf4811cb2e3c2" -> "796faa1eecc66f24fa7528643b533288"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "523b770bf07e08503e81c3f6087f2d13" -> "34678ed2a63420798387633640de2de9"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "68f88a9745e8ccb30b01b0862f56f9c8" -> "02faa7325bed6b627e87ae68ed27ba25"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "0b059ca8536ea2b111978a90b4b2b174" -> "f2411e16dd9dc865aa97ced79b1852dc"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "1f4320e070a8a3552f7839143541eea6" -> "411aa883a494b651f30308e2c9883d69"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "4f09a0cd7e8c7f060e49f35daea9a1c7" -> "28ff6115bbddebd97dc7f04b7e9ba089"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f0e54b9bca3aae4576b7748be4118fba" -> "2ea03f8e10bc7f1d0b82abcb105e54e6"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "cd5ef6e0a70212640df3816710309106" -> "9019a2e8718cd0217e07e518ac35a9d4"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e8c02a3806e3a7a38bc5c1b9245824fe" -> "d36856467319095c86d2ae90d8733de0"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "6f6404e590ca7329c291bbd7ca9c2e2e" -> "766e57696e9f53c2576615837296c5e8"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "aefe28017c94058c5306e7846eb5b85b" -> "11a6733acdf34ab4129631166c380f39"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "183bd6c28c286b1a75581b42aff2efea" -> "901d36c70609f57da99fa9f5b7ff3386"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "3475c3b0460254e891944e4bd5d55d2d" -> "cd45f2b42da38f783802015d33db07c5"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "a50652519174bd99ef07ce317e3e7aa8" -> "86bf29c807afe1e1ac46d6278006dfff"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "b7905316d2adcd45c87b61c9fcdc2308" -> "88715fd95c2a227c83e5564378789809"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "9c75d1b2e3cc5dd7e76eb81ee20921a0" -> "358f8d7b4dcf730082956dfe9e91fcce"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7f66e3ef6f41617d8712a3ddc21cada7" -> "db7fa1ce9085d4fda0731d15c8aaee75"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "5b4f81992f27b3a31960aa618a2f3ecc" -> "ad1acf1fb7ff4110ff32a1f45bec6a48"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "2bc42e1871125963d734eac22fed0225" -> "378205170ed993487b6a724facb6100e"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "4ad227eb3e74a85574d3b54699ac421c" -> "3ee29e72b087ec6e34dc611457647fb5"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "fc00a560b243e84c99e609eacdc40677" -> "ecc650b99aefc707761d01bb473b9b6e"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "42ca2fb692552bf2775aef3e54f1236c" -> "0e4424b8444039dc19d03a359dae5f20"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "c26f8703675c3928dd1ec38c411e852a" -> "8188f127b4b1f3f2c01c88e1b3118d58"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "f0cf3cb7f2ef475fcb6f24a7ead92574" -> "8490a6791297d4669d22eee011f07b1f"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "1c5f3a44581789f39a86322b471f4bf5" -> "c5384895269333655db41c8ab5a9896e"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "02cd987236dcb82ad3132368a7ad922a" -> "51ab9157bb5325ef9254cb5f9514b91e"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "b0250ce808ed4e3417c67728e91a6135" -> "5f3d130aff85042c917e039ce7e7eada"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "9cf4711f41c324d42b88b55538569865" -> "f85e00bb59f377d8900920fa5caa4eaa"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "baf5556041fa35d121ff5d23df01a9e8" -> "14e412678a06f021e64547cfcd6b38e5"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "80deeff267036c7db43c2231f7ed0655" -> "737825e2b06391c94b3c9fe0a95f583e"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "3227dc25a31564a1bf949811d978f518" -> "924419a1838b6e277d4ffdedafd92ae0"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "dbc043a7e7081aefb875a88dee8b9ea5" -> "f80658d7da23b55ff30f07a32d057b01"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "L0l9w/LUOnAPWeRWWpFGqYRSCM4x4ZbSFG2+sSGWfGE=" -> "/qc9GYBYwy6lg26KVz5PiI9duJ/c20xZYtubDYz/jJ4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ouO1/siMWws+Tg/UVNTFy5pvkoNcBC1e47GJFAKpS/U=" -> "2mPCSXqQiOQTREqU/hrk7VC2qPGtZGA78aB7S1miJQw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "9b3Aoay3AHTLFekjpOIQlYNPuHlqUUPMUjLrekgqUOM=" -> "MluAn8Q+bXB99YfuQs0W765eeVaLURijj3SlhIZXUNk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "zJnuuxEd53dB+c02lrQzKbxxVV91bzbEh6SxTO3K6RM=" -> "TvligJjWw0iVHHLiYix8LJQOu7qqa+rzLe/OITnb3tQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "m5PqWZaAB/3Ipw8SJLO6ROAPky+twfdXXVXEXmgRrNk=" -> "aRiBYySc04bmpqvOH9UkdMzeENGljn1vIZChkmV4c2E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "AXxEalKVwy/Lq2S3TEElM+Z8UE+3kIU9nEr8Hvb2fqU=" -> "ad9wbFpHWK0OyNetwI/pB56F1YMw1NPJtXMlAjHoH+Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "ueXTXYAcQZNfvoEm/kFTjCmdc8AoEEZszXhn7xlmWCM=" -> "PnW+bZanqr6Ti0QzcI6y/tcUAIZdQgd05ByvigrDABg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "EDu+4Xbfd16SVRTcGbd3erYMQbgN/mgikTP7H1OZz3w=" -> "mKM+hSg6HuJJW9z7Ihfk29uyYM3AWa9UApFBVePIRw8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "NRGIpMvuI2g/jHxC02dHKIpAQsOVa+ED8pTGerDI+o0=" -> "Cl8b9fUHxieLUjLFEJOFg7Xnkg9w8/awvGvSUjNx7IE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZT17nljKBhsGiExXynfaZcOlwC+bBnd+/SVUqwY1v94=" -> "lmp4sd0veHQsC9Xm31fAVP1rr1NysJpm3esxFeskhxE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Iqq3YckCBN0WTAtINnlMSzmGtFvJjwvBG1BWzY5MePE=" -> "OPfN3UQfWnixaWF5dPuHwN3/SjdZDpNeIEKiLUyzkjs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.048+0000" -> (known after apply)
      ~ source_code_hash               = "s7zR0z9POPE/e6j63GBOZ1JNa/w4xZ/nQ8RGuHQ4LPs=" -> "LOrrjQ4zXFopKU/Bo2A4Hp1iBBugxxk2buTvkdTaLA8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bhqb6ui6BcwO5wPIuNKjsOdGg4tTVY0v0j2ksFDDK5E=" -> "HnuOzKYSjaOHj76vYYUlsb9gO04P5VOM88vY0zaRUa4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "kbJTwmQpfn9OQ7v7xf6yMWPJtogJJ8huk6uLy1p0k6g=" -> "h9YjklwTVGLE+iS43WaEIy/8marMvMxO6Ggjek4fWAA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "bBz9iKqFXZ5oGZfuctRZP+/DVQWYeaFjrgFSBsqVftU=" -> "IN21tCLPEK0TSShqtuYQ+CmnTSu5LgKvT/9SqbYi/TE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "yfG18UnEa8Si3yD0RVGEUQmCVjAFg7JL5oayJrdszVE=" -> "4CCBgJOXI7ku1ibrHEG0w2NoC9mG54aDQX92DHYfQ2I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q+ATtGUM4Ycsp7xBbqMlRHnTarlV29hPLUWQx6wdywQ=" -> "ztNrB1TUKM1b6sPu+/IKIOSHKwLaHghl5phQN8tPIXs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "NEWix2wfCHWigp/rGPp6MzQ2xDQUBbT78NQr8KfEtOw=" -> "3pIIj+pbq78TghC9chvp9PG78XDewmNj/f8bBKoOQgk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "AS++zzwQBkvk5Yj6qiEVa41By26MKRNb3+zkjzy4kw0=" -> "IzRcL201t+Si1alS87I0nMd1ZTHTiHEzdWiymA0s4eY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "m6HPI0pYQ3CGOsvKL23013faUx0I7EcAYVjWvuY4IxM=" -> "/Xs2f2xQUjlV57SBMhHHjXWMGndxG+/flioqguNc7po="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "RRwQXcrQNgZ3Jv3Ylaa7OOoimSEplV+p1oSzjNNryH8=" -> "EsjjDtXo1o2bka+pOkyBNoW+NNAoi/5f9bUsNTfNDFA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "2ROWm3jLGrAeB4xiiwfnewdjPxgghOyYL9AwaaNCpq8=" -> "zR7S1XrHc8BSQvfZ03x1pFt3VwXZDBvlkZ0e+A6qP+s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "wKepvwT6jx+NoQaT7az9pkS66R62lPlK1ls7KFoQ86s=" -> "x+ovkxZt1LyD5ICUZgAxZ1ZZLt4jwg+DAj896epTxpk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "iXwcJx1xH58F2KKBFhrWAfCa36T/zQaUanSbHXtLtbc=" -> "rlXup0o/aP3CqF5RvaODQZ1wHfjsXtw/mQOmNt1I3CQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-21T03:31:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ii9NCD/8l4F4i71a+N5Tn+HWIGKiHLbwBa1xsQAvh3k=" -> "kzuQzkTg/YIJPJRbvNgeIIHQnrAMF4neu+cG9TF/CMs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "VOC80MSGwSZKu90RT5+fRGWKOmlWMvHlGapRkhH0kq8=" -> "BWpiYAHm3BtjQCDvRtzWbl4P0QTEc0knBXYlSaZKYow="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "xfq8hNaBTvHxwpjno1kUX/dghIzLSU7OAVm/EYxU2H4=" -> "/guqjw7YbV6g2DRqPgYx53e7vull66TnNETZYNxAsOc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yDbtUTMXcav1JJqHsKNV7N2byCXIX9A/hs47cD7pqvU=" -> "la886WInf9gUu8Zz1CmSXkgMYClttVZSPPz7cRRYyC8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "ct8Vvxdpr5Mm1v+3X0qCLmj0QJAQJwnH3H2JENv1S9g=" -> "lJDT+zFYjBBu96AOUaBpk8b5YZUALM8U6TiQKk6IwFY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-19T15:40:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "n74A2nSqUnbScU2OG0plV3z2LBL51s7P40/6RnPKhQ4=" -> "sxvpFQ87mojW1Rkohze3Wab9dZguorokrHghqM4JT7c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "y9CAh/eiSIb/4eBz5rwF1eWLhB1ul1Eftv65+IsK7mA=" -> "zt6baPhbnstwLvwh+OmEJwix1Z9LfksBfQZO03gi6OY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "nmgbEClnpQn/8CBpIlvglCfU/JCMtDxpRA9F+1tX3cs=" -> "aizdo94y0YU9QX0xrdRkGSp7SWa/Ds7neBV5RahgSfc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "UnAykZq0oRSsaGuNp/DZAa1Juu48M77k1tvyjlStUF8=" -> "otKb0Q7TxkkpIIblF0jJHfnyIhytg/QiETJkEWxagZk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "TII9KzTL8kfjQR5CsuEKJmtjTi1AbB0NFdOdeE3E2ro=" -> "BRiBbiH4eijYJNNJgYdYzlmL2E/hDKo5aEC07AF77A4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "6vBYkANzSSZEHvwiB8r/0NS6gzPuM86Ak82CDbYg9Fs=" -> "6QNITBuRHQB5Io0xnZyRx6G0713glSlKDUZs9moCC4Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "OQBGmlhxzLK9d1hMB76DGXN8MYWFCwVqed1M1INrKvQ=" -> "+PFDE0nrYkquxkAq4a5ICaN0GCeOp/qsoGzvfJdtHWU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "kBP0/pruva19T7CVoJttksFOnGdD9EKDj8M1owir46U=" -> "wb3vYv5Ml8PxY/Y+1xW7iXnHDJf67X5TP3+dCuQK838="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "qTTqw2sRQ53+Jn9C5+RTpJYm4xyDn8j364P3yzX3Wt0=" -> "4ySwG0S0gFzvkJr0gnrssA4aEqyLszCgzDvbVY5Eva0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "2AvEjneqTOWEZjdhnp8s8y4Gn7WgFRCVzKTHPspueug=" -> "wsvnNxtNZrEAXm4x3CrOOAqzc674g0DuegRmBHVP9wA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "40zNJzZ19czzxc2OcYcLce7+ardm5BsZBRW36VuBKPY=" -> "1dxlrCjXH1dEJOnJJH9HnjRwcUUh5/ZNq4pral4l8iM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "PWLIdkSRaYfWnrxkwDyZYeIlYMw5A04KnfQgaFKS0HE=" -> "unzeq/B6gv2K0mDEA3piItZ6HE2qkNbQlxs+w15eyhU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-17T19:16:40Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "pgdiga" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 85 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*